## Student Data Analysis

In this activity, you will use the steps below to analyze a dataset of student test scores from schools in a fake school district.

1. Collect the data.

2. Prepare the data.

3. Summarize the data. 

4. Drill down into the data. 

5. Make comparisons.

### Import required libraries and dependencies

<!-- https://pypi.org/project/pathlib2/ -->

In [1]:
import pandas as pd
import os

## Step 1: Collect the data.

To collect the data that youâ€™ll need, complete the following steps:

**1. Using the Pandas `read_csv` function and the `os.path.join` function, import the data from the `new_student_data.csv` file, and create a DataFrame called student_df.**

In [2]:
student_data = os.path.join('../Resources/new_student_data.csv')
student_df = pd.read_csv(student_data)

**2. Use the head (and/or the tail) function to confirm that Pandas properly imported the data.**

In [3]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11th,Chang High School,87.2,64.1,Public
1,33365505,Francisco Osborne,9th,Fisher High School,NaN,NaN,Public
2,44359500,Ryan Haas,12th,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11th,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12th,Chang High School,68.7,43.4,Public

## Step 2: Prepare the Data

To prepare and clean your data for analysis, complete the following steps:
    
**1. Check for and replace all `NaN`, or missing, values in the student_df DataFrame.**

Use the following methods and functions to complete this section:
* `count()`
* `dropna()`
* `duplicated()`
* `sum()`
* `drop_duplicates()`

In [5]:
# Check for null values
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1414
math_score        705
school_type         0
dtype: int64

In [6]:
# Drop null values
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
dtype: int64

In [7]:
# Check for duplicate rows
student_df.duplicated().sum()

1299

In [8]:
# Drop duplicate rows
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

**2. Use the `str.replace` function to remove the "th" from the grade levels in the grade column.**

In [9]:
# Check the type of the grade column with dtypes
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
dtype: object

In [10]:
# View the grade column to look for a reason it isn't numeric
student_df['grade']

0        11th
2        12th
3        11th
4        12th
5         9th
         ...
13935    10th
13936    10th
13937     9th
13938    10th
13939    11th
Name: grade, Length: 10604, dtype: object

In [11]:
# Remove 'th' suffixes by replacing with and empty string
student_df['grade'] = student_df['grade'].str.replace('th', '')

In [12]:
# View the grade column to ensure the suffixes were removed
student_df['grade']

0        11
2        12
3        11
4        12
5         9
         ..
13935    10
13936    10
13937     9
13938    10
13939    11
Name: grade, Length: 10604, dtype: object

**3. Convert the data type of the "grade" column to a `int`.**

In [13]:
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
dtype: object

**4. Use the head (and/or the tail) function to preview the DataFrame.**

In [14]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type
0,127008367,Sarah Douglas,11,Chang High School,87.2,64.1,Public
2,44359500,Ryan Haas,12,Campbell High School,91.6,54.7,Public
3,24791243,Kathryn Mack,11,Richard High School,68.9,73.3,Charter
4,121467881,Harold Reynolds,12,Chang High School,68.7,43.4,Public
5,79397676,Kyle Brooks,9,Turner High School,72.6,55.4,Public

## Step 3: Summarize the Data

To summarize your data, complete the following steps:

**1. Generate the summary statistics for each DataFrame by using the `describe` function.**

In [4]:
student_df.describe()

         student_id  reading_score    math_score
count  1.394000e+04   12526.000000  13235.000000
mean   6.963653e+07      75.360019     64.458202
std    3.470554e+07      14.252688     16.672861
min    1.000132e+07       9.500000      1.400000
25%    3.959119e+07      66.000000     52.900000
50%    6.986363e+07      76.500000     65.200000
75%    9.967827e+07      86.475000     76.500000
max    1.299997e+08     100.000000    100.000000

**2. Display the mean value of each numeric column.**

In [5]:
student_df.mean()

student_id       6.963653e+07
reading_score    7.536002e+01
math_score       6.445820e+01
dtype: float64

**3. Display the maximum value of every column.**

In [6]:
student_df.max()

student_id               129999733
student_name            Zoe Graham
grade                          9th
school_name      Woods High School
reading_score                  100
math_score                     100
school_type                 Public
dtype: object

**4. Generate the minimum math score, and store it in the `min_math_score` variable.**

In [7]:
min_math_score =student_df.min()

## Good work!

You are now prepared to start the next lesson before starting step 4.